gptnix/gptnix-watcher-firmware/examples/factory_firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_CACHE_32BIT_ADDR_QUAD_FLASH=y
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SR_WN_WN9_JARVIS_TTS=y
CONFIG_USE_MULTINET=n
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=64
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=48
CONFIG_BT_NIMBLE_TRANSPORT_ACL_SIZE=512
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=32
CONFIG_BT_NIMBLE_BLE_GATT_BLOB_TRANSFER=y
CONFIG_BT_CTRL_TX_ANTENNA_INDEX_1=y
CONFIG_BT_CTRL_RX_ANTENNA_INDEX_1=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3000
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=10000
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2600
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_FATFS_LFN_STACK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=1600
CONFIG_LWIP_LOCAL_HOSTNAME="SenseCAP-Watcher"
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_BUFFER_SIZE=20480
CONFIG_MQTT_TASK_PRIORITY=12
CONFIG_MQTT_OUTBOX_DATA_ON_EXTERNAL_MEMORY=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_BUF_MAX_NUM=32
CONFIG_LV_IMG_CACHE_DEF_SIZE=1
CONFIG_LV_USE_LOG=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_QRCODE=y
CONFIG_BSP_LCD_DEFAULT_BRIGHTNESS=0
CONFIG_BSP_LCD_PANEL_SPI_TRANS_Q_DEPTH=1
CONFIG_BSP_LCD_SPI_DMA_SIZE_DIV=16
CONFIG_LVGL_PORT_TASK_PRIORITY=11
CONFIG_LVGL_PORT_TASK_AFFINITY_CPU1=y
CONFIG_LVGL_PORT_TASK_STACK_ALLOC_EXTERNAL=y
CONFIG_LVGL_INPUT_DEVICE_SENSITIVITY=20
CONFIG_LVGL_PORT_TASK_MAX_SLEEP_MS=5
CONFIG_SSCMA_EVENT_QUEUE_SIZE=1
CONFIG_SSCMA_PROCESS_TASK_STACK_SIZE=10240
CONFIG_SSCMA_PROCESS_TASK_AFFINITY_CPU1=y
CONFIG_SSCMA_PROCESS_TASK_STACK_ALLOC_EXTERNAL=y
CONFIG_SSCMA_MONITOR_TASK_STACK_SIZE=10240
CONFIG_SSCMA_MONITOR_TASK_AFFINITY_CPU1=y
CONFIG_SSCMA_MONITOR_TASK_STACK_ALLOC_EXTERNAL=y
CONFIG_SSCMA_ALLOC_SMALL_SHORTTERM_MEM_EXTERNALLY=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# M3C follow-up (plans/M3C_AUDIO_BRIDGE_CHILD_TASK.md, live-tested 2026-08-21, DISABLED AGAIN -- do not
# re-enable without further investigation): CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK cuts the initial
# response latency from ~50s to ~6-7s, but TWO separate live physical tests -- once as-shipped, once
# with a local patch (components/esp_websocket_client/, see its own inline comment) bounding the one
# unbounded portMAX_DELAY wait we found in its send-error path -- both still froze the session completely
# after the FIRST exchange (zero further WS traffic, local send buffer overflowing nonstop for 60+
# continuous seconds). The patch fixed the ONE unbounded wait we found and located by code review, but
# clearly not the actual hang -- there is at least one more root cause in this vendored client (or
# elsewhere in this call path) still unidentified. Disabled pending that root cause, not just another
# guess-and-test cycle -- correctness over speed until the actual mechanism is understood.
